group1 = ["Иванов", "Петров", "Сидоров", "Кузнецов", "Васильев", "Морозов", "Новиков", "Козлов", "Лебедев", "Соловьев"]
group2 = ["Ким", "Пак", "Чон", "Ли", "Квон", "Хан", "Чжан", "Сон", "Ён", "Пэ"]

team = tuple(group1[:5] + group2[:5])

print("Группа 1:", group1)
print("Группа 2:", group2)
print("Спортивная команда:", team)

print("Длина кортежа:", len(team))

sorted_team = sorted(team)
print("Команда после сортировки:", sorted_team)

if "Иванов" in team:
    print("Студент Иванов входит в команду.")
    print("Количество студентов с фамилией Иванов в команде:", team.count("Иванов"))
else:
    print("Студент Иванов не входит в команду.")